[
  {
    "file": "messages_translated1.html",
    "message_id": "message77930",
    "username": "Confusion",
    "time": "22.08.2025 09:07:53 UTC+05:30",
    "text_snippet": " \nYesterday there was a news report that UWSA is no longer supporting its board MNDAA, TNLA, SSPP, etc.===================\nThe news is not Fake News, but the UWSA itself has called and interviewed in Pennsylvania.\n===================\nWhat... They said they were no longer providing weapons and financial support, so to speak, they had supported it in the past.\n===================\nOkay.... The MNDAA and TNLA have grown so much because of the support, because of the support, and how can they grow otherwise, there is no infrastructure like the 0.\n===================\n1027 During the invasion, his subjects got a lot of territory, and even the UWSA still took the territories that they were crazy to keep here and there\n===================\nWhat a joy it is to be part What is going to happen now, what is going to happen... The army has seized the Horn, and the line is on the Outer Plains-Lasho road, and the towns of Sindhi and Hobab are day and night.\n===================\nIn the meantime, the MNDAA has not fired a single shot because it has been forced to turn the army back to the neighboring city of Clarence. UWSA also seems to be looking at China right next to him, and he has a show on the border with Thailand in between, and that's political\n===================\neconomic, the economy is the main thing that is important for a province or a city to visit, the economy is the import and export of the country, the economy is the export of the country, the export of the UWSA is from China, the export of goods to China is through the mandatory. Maybe that's why the UWSA doesn't support the border bowls, because they can't get anything out because it's not cold, they don't have enough goods to export, they don't have enough goods to get around, not to mention Chinese, even in their region\n======================================\nSo yes, at that meeting, we put the national flag in a row with the armed flags, and we didn't just provide weapons and money, we didn't provide the rest, we needed the rest of the supplies, we didn't need weapons and money where the rebels were going to live, we needed resources and provisions.\n===================\nEven some people who were walking around in those areas said that the UWSA were walking around in MNDAA uniforms... Now\n===================\n if you really want peace and federalism, you can't just go around and support it, just keep on the screen and see what their current statement is.\"\n Telegram Link: \nhttps://t.me/minhtetkyawzaw\nTikTok Link: \nhttps://www.tiktok.com/@minhtetkyawzaw706\n\n",
    "word_count": 428,
    "locations": [
      "to the neighboring city of Clarence.",
      "show on the border with Thailand",
      "important for a province or a",
      "province or a city to visit,",
      "doesn't support the border bowls, because",
      "even in their region ====================================== So",
      "around in those areas said that"
    ],
    "score": 15.2,
    "matched_keywords": {
      "rebels": 1,
      "army": 2,
      "china": 3,
      "chinese": 1,
      "MNDAA": 4,
      "TNLA": 2,
      "UWSA": 7,
      "SSPP": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77871",
    "username": "Unknown Sender",
    "time": "21.08.2025 11:43:14 UTC+05:30",
    "text_snippet": "\n\nThe Revolution \nof \n the Armed Rebels \n---------------------------------------------------------------\nYesterday in the capital city of Pansan, \"Wa\" Province, UWSA Deputy Leader \nXi Kang An, and the Armed Forces\n of Shan Province\n: Deputy Chief of the KNDAA Force, Li Long-pong,\n General Secretary Sun Ke-chang;\n- Vice-Presidents of SSPP/SSA Shan Force, Swakunsai and Swakaithai \n- Deputy Commanders of the TNLA Plumbing Corps, Takulan and \n Secretary Tarbon\n, attended this meeting\n because the UWSA \"W\" Force is the one that provides \nthese three armed groups from behind the scenes, including \nmanpower, weapons, and financial resources, in Operation 1027 and other battles. \nWhenever there are clashes, the men \nof \"W\" are fighting in their respective armed rebel units\n, changing into military uniforms.\n This is because,\n among the armed rebels, the only rebel groups that have \ntheir own weapons factories are the \"0\" and the KIA.\n It is\nnot easy to fight in the long term without weapons and ammunition.\n Financially and politically, the \"0\" brigade is\nthe most powerful of the rebel groups.\n \nIn\n the past few days, George N. Sibley, Chargé d'affaires of the U.S. Embassy in Myanmar, traveled to the\nriver and met with KIA leader Guan Moor to discuss the land issue and \nother issues.\nNUG/PDF, China has called in the armed forces and other groups to\ndiscuss providing weapons and military assistance, and posted on\nsocial media.Just\n after this meeting, China put strong\npressure on \"Wei\" from behind and officially announced that it would no\nlonger provide military aid to such armed forces.\nIt also shows that China fully supports the Myanmar military\nin order to defend its interests, and\n the Lara and Lara are different in the armed forces.\n Such a formal cessation\nof military aid by \"0\" would also\ngreatly weaken the armed rebel groups.\n In order for the upcoming elections \nto be held peacefully, we need to be able to retake the territory.\nThe KIA\nis not going to be able to fully produce the ammunition for the sake of it.\n The KIA itself is fighting in the territories, so \nit has the weapons/ammunition requirements.\n I see the \nonly ones that will be suppressed in this scene are the PDF and the TNLA.\nThe coming political scene will come a \nperiod in which the fighting will intensify and\nthe rebel forces will be torn apart in order for \nthe army to regain \nterritory.\n\n",
    "word_count": 396,
    "locations": [
      "in the capital city of Pansan,",
      "traveled to the river and met"
    ],
    "score": 15.15,
    "matched_keywords": {
      "forces": 5,
      "ammunition": 3,
      "rebels": 2,
      "military": 5,
      "army": 1,
      "china": 3,
      "KIA": 4,
      "NUG": 1,
      "TNLA": 2,
      "PDF": 2,
      "UWSA": 2,
      "SSPP": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77808",
    "username": "Unknown Sender",
    "time": "20.08.2025 13:24:26 UTC+05:30",
    "text_snippet": "\n\n88 The difference between the NUG and the NCGUB that👇👇👇👇\nDr. Sean Wing is talking about: Let me tell you a little bit about the conclusion that the NUG and NCGUB will end up like Dr. Seinwin's far-flung\n coalition government, they will only exert diplomatic and international pressure, and the NLD members in the government will follow the principles of the NUG, and they will not carry out an armed revolution. \nThey only seek help from the donors in order to stand up for the NCGUB. They don't lied to the people and don't donate to the people, they don't reach out to the country, they understand that they are passing through local forces, they don't interfere, they believe that domestic politics is not central, they \ntravel internationally, they do everything they can to get involved in parliaments, they are criticized for not living in border indigenous areas, they have problems, but NCGUB is a student body.We treat all political organizations with respect and respect, so we don't lose our relationship with each other, even though our politics are different, and we are all polite, and\n the NUG we now form is a collection of liars, thieves, and crazy people, and we are motivated to send our families to war abroad, and the NUGs do not even go to\nbasic education, they threaten their education, they kill their teachers, they kill their priests.\nThere are the boys who have young wives, the\n girls who got pregnant because they bumped into the captain, the \nmarijuana beer shop, the KTV room guard, the\n morally fouled lower class mobs, the \nguys who cheat and steal public sweat papers in all sorts of ways, the \nDow Passage and the Mercury Railroad,\n the NLD Senators\n.Take place in the NUG, take place in both the NUG and the CRPH. They have no principles, \nand they are shameless, but they are not ashamed to slap their descendants.\n \nThere is no\nnagar, no dignity, no\nability\nto lead a revolution, everyone who understands politics knows that the NUG revolution is over, there\n are only two roads: whether you\ngrow old and die abroad, or go back to the country, or you want\n to go back to the country, \nthat's why I am saying that there is no end to it, like Dr. Saint Winn. Crime awaits them.\nhttps://t.me/KKM28640\n\n",
    "word_count": 391,
    "locations": [
      "not living in border indigenous areas,",
      "in border indigenous areas, they have"
    ],
    "score": 11.01,
    "matched_keywords": {
      "forces": 1,
      "NUG": 7,
      "CRPH": 1,
      "NLD": 2,
      "KTV": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77921",
    "username": "Confusion",
    "time": "22.08.2025 06:20:23 UTC+05:30",
    "text_snippet": " The NUG terrorist group has ordered that their subordinate slaves, the Pakhaf factions, must come to the aid of the TNLA, which is dying of dead dogs... \nIt's like dying for the TNLA, so to speak... \nThe TNLA was a group that treated the MDY-PDF and DPLA groups that fought alongside them with a slave attitude when they gained a small amount of territory... \nSending a TNLA team that doesn't have enough ammunition to come to the rescue is like saying they're going to death... \nThe NUG guys will never fight..? \nConfusion ",
    "word_count": 92,
    "locations": [],
    "score": 9.5,
    "matched_keywords": {
      "ammunition": 1,
      "NUG": 2,
      "TNLA": 4,
      "PDF": 1,
      "DPLA": 1,
      "MDY": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77863",
    "username": "Unknown Sender",
    "time": "21.08.2025 06:53:17 UTC+05:30",
    "text_snippet": "\n\nThe UWSA 0 has called together the MNDAA co-operatives, the TNLA Plum and the SSPP/SSA co-leaders and told them that the UWSA will no longer provide any military equipment, weapons, ammunition, or mechanical aid.\n\n",
    "word_count": 34,
    "locations": [],
    "score": 5.6,
    "matched_keywords": {
      "ammunition": 1,
      "military": 1,
      "MNDAA": 1,
      "TNLA": 1,
      "UWSA": 2,
      "SSPP": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77829",
    "username": "Confusion",
    "time": "20.08.2025 19:13:56 UTC+05:30",
    "text_snippet": "\n\nArmy takes \nfull control of Dimosso\n August 20, 2025/By Hla Yamin Oo\nThe city of Dimoso, temporarily controlled by the KNPP, KNDF and PDF, was recaptured by Army forces on August 19.Army\n lines cleared the area of Dimosso Township on August 7 and the village of Padodou in the southeast of Dimoso. On August 14, the township police station, fire department, township public hospital, and township general office in the Victory neighborhood were gradually recaptured, and on August 15, the entire Golden Grove neighborhood and the town hall in the municipal area, and the Czech school site in the township district, and on August 19, the KNDF and KNPP armed groups were forced to withdraw in a series of skirmishes. It was completely recaptured. ",
    "word_count": 124,
    "locations": [
      "Yamin Oo The city of Dimoso,",
      "lines cleared the area of Dimosso",
      "7 and the village of Padodou",
      "August 14, the township police station,",
      "the township police station, fire department,",
      "station, fire department, township public hospital,",
      "public hospital, and township general office",
      "in the municipal area, and the",
      "site in the township district, and"
    ],
    "score": 5.31,
    "matched_keywords": {
      "forces": 1,
      "army": 3,
      "PDF": 1,
      "KNDF": 2,
      "KNPP": 2
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77949",
    "username": "Confusion",
    "time": "22.08.2025 11:12:45 UTC+05:30",
    "text_snippet": "\n\n#န\nVote for the USDP that may be in the early stages of the election There \nare people who come to us asking\nwhich party to vote for\nin the election, so today I\nam writing which party\nyou should vote for and why: \nElections are\nimportant in a democracy, and it is also very important for the\npeople to be able to vote regularly\nin elections. \nIf you don't want to be\namong the people who voted for the NLD\nin the elections held in the past few \nyears and have lifelong\nregrets, I would like to urge you to\nvote for the USDP\n. \nBefore I talk about\nwhy I should vote, I would like to remind you that the country was bloodied\nby the one vote you cast\nin 2020. I want those who voted for the NLD\nto learn from the backdrop and vote in\nthis election, and \nI want them to vote.\n \nI would like to explain\ntwo reasons why you should\nvote for the USDP, and if you write it broadly, it could be as much as\na book. \nFirst, it has the credibility to delegate state power to\nthe USDP. \n To\nbelieve in an institution cannot be built in a\nshort period of time. You have to\nknow the historical\nbackground and political origins and believe in it to vote. \nThe USDP is not the party that\nemerged yesterday, and the best\ntime in Myanmar's history is that the USDP\nis in its 20s\n. \nI'm now over 41\nyears old, so\nI've been through the NSP government, the NLD government,\nthe government today\n, and I've \nnever had a better time\nthan the USDP government of the NSP.\n The \nU.S. and the international community\nalike have been very gentle about the Spring Change\n. At the time\n, the bloody Arab Spring\nwas celebrated and compared\n. \nRay has the ability\nto befriend\nan indispensable enemy, as well as the ability to move the country smoothly through\nvelvet politics\n, and \nthis experience\nis a good political\nstarting point for the USDP. The\npeople's socio-economic life developed under the USDP government. \nAs an undeniable fact, the 1,500 cents who are consuming \ntoday have \nthe evidence, and\nthe envious will blame the previous government for mixing with the previous government and devaluing\nthe debit\ncards, but \nthe obvious step\nthat the bold change during the USDP\ngovernment has changed the social life of\nthe people. What was developed\nis still a testament to history to this day\n. \n \nThe voice of President Hun Sen's speech of respect for\nthe people is\nstill imprinted in the hearts and minds\nof the people to this day, this \nis the symbol of the USDP, this\n is the image of the history of the USDP,\n so that the people\ncan\n govern with love and kindness in the hearts of the people.The party is also the only party\nin the present moment, \nso to say that the USDP has\nthe full potential that the people believe\nin, and \nsecondly, because the USDP is\nin harmony with the army, and \nour country is\nnot yet a liberal\ndemocracy, a mature democracy. Nor\nis the civil armed conflict as a one-night tale\n. ",
    "word_count": 543,
    "locations": [],
    "score": 3.1,
    "matched_keywords": {
      "army": 1,
      "NLD": 3
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78000",
    "username": "Confusion",
    "time": "23.08.2025 10:38:51 UTC+05:30",
    "text_snippet": " I'm going to collect money,\nI'm going to pick up a gun, I'm going to take a picture\n in\nthe street\n, and I'm going to go to the KTV,\n and even the guys in the NUG are doing whatever they want, and you do it, and don't forget😁😁\nto kill the people who support you to get your guns. ",
    "word_count": 60,
    "locations": [],
    "score": 3.0,
    "matched_keywords": {
      "gun": 1,
      "guns": 1,
      "NUG": 1,
      "KTV": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77739",
    "username": "Unknown Sender",
    "time": "19.08.2025 08:20:46 UTC+05:30",
    "text_snippet": "\n\nThe TNLA and MDY PDF camp is being held in the East Side\n of \nthe Matara Township\n, Mandalay Township.\n\n",
    "word_count": 20,
    "locations": [
      "and MDY PDF camp is being"
    ],
    "score": 3.0,
    "matched_keywords": {
      "TNLA": 1,
      "PDF": 1,
      "MDY": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77911",
    "username": "Confusion",
    "time": "21.08.2025 20:36:59 UTC+05:30",
    "text_snippet": " I think it's nice to see that they're posting a lot... \nYeah... It's a KIA drone in Venmor,\n it's a weapon that looks directly through a drone camera and makes a visible attack on the enemy.\n It doesn't run into creeks, ditches, and building craters, and\n it looks like it's a whole bunch of rice from behind. \nThey're demonstrating their capabilities with new weapons and systems, and\n they're becoming more effective and explosive than they have ever been.\n Look, there's nothing to discuss in the bloodshed.\n Wave after wave is coming.Hi😄😄\nHi, \nthe picture is just posted,\n the hack\nvd is very recent, look for it.Click\n 😁😁😁😁\nto 👉🏿 read the news\n\n",
    "word_count": 112,
    "locations": [],
    "score": 2.9,
    "matched_keywords": {
      "drone": 2,
      "weapon": 1,
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77950",
    "username": "Kyaw Swar22.08.2025 11:06:05",
    "time": "22.08.2025 11:12:45 UTC+05:30",
    "text_snippet": " At a time like this, only by voting for the USDP party, which is historically and\npolitically aligned with\nthe military, can civil-military relations\nsmooth and push the country in a positive\ndirection. \nWe\nneed three forces: the government, the people:\nthe House of Representatives, and if there are partisan\nrepresentatives in\nthe House of Representatives who have asked for a stop\nto the offensive, it will be\ndifficult to do. \n There used to be. \nJust as a government needs to be in\nharmony with the military, the military needs to\nsupport it. Political\nscientist Hamilton once said\n, \"In a democratic system, it is often said that\ngovernments that are not supported by the people\nfall, but\nin reality governments that are not supported by the military are more likely to fall. \n If you look at the current\nsituation in Myanmar and the situation\nin Bangladesh, you need to learn \nfrom this and vote for the USDP\n, not \nto mention\nthe other parties\nat the moment, in \nthe 2020 elections\n, there were parties that were\ninvolved in the interference of foreign powers. \nIn one of Dr. Nate Lat's books\n, I read\nthat Sojos\nsaid he was responsible for bringing the NLD to power, and the U.S. Embassy\nannounced that it had provided $46 million\nto the NLD government during the 2020 elections. \nI can't say that, but we have to\nlearn a lesson: we need to stop\nvoting for these parties, and \none last thing I would like to say is\nthat we would like to\nurge you to put your trust in the USDP\n, which has the ability to move the velvet politics\nsmoothly according to the lessons\nof history.\n \nThird Wave Democratic Transition\n (Translator-Zinwetho)\n Winner of Political Science \n (Perseverance) ",
    "word_count": 296,
    "locations": [],
    "score": 2.51,
    "matched_keywords": {
      "forces": 1,
      "military": 5,
      "NLD": 2
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77944",
    "username": "Unknown Sender",
    "time": "22.08.2025 11:08:44 UTC+05:30",
    "text_snippet": "\n\n21-8-2025 Yesterday, 21-8-2025, the Army destroyed a large dog and a small dog from the 7th MDY-PDF Battalion, a total of 2 large dogs and a small dog.\n\n",
    "word_count": 28,
    "locations": [],
    "score": 2.3,
    "matched_keywords": {
      "destroyed": 1,
      "army": 1,
      "PDF": 1,
      "MDY": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78015",
    "username": "Confusion",
    "time": "23.08.2025 15:41:14 UTC+05:30",
    "text_snippet": " TNLA \n/pdf\n Terrorists Unable to withstand the army's attack in\nNhung Binh and fleeing the village of Nhung Binh by burning fire ",
    "word_count": 22,
    "locations": [
      "and fleeing the village of Nhung"
    ],
    "score": 2.1,
    "matched_keywords": {
      "army": 1,
      "TNLA": 1,
      "PDF": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77901",
    "username": "Unknown Sender",
    "time": "21.08.2025 19:20:51 UTC+05:30",
    "text_snippet": " NUG's daughter\n of poison king Zhao Weishou, while \nthe people were fleeing the war, the NUG's daughter was only happy with donations\nabroad. ",
    "word_count": 23,
    "locations": [],
    "score": 2.0,
    "matched_keywords": {
      "NUG": 2
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77961",
    "username": "Confusion",
    "time": "22.08.2025 15:40:21 UTC+05:30",
    "text_snippet": " On the other hand, I chased KIA until I couldn't find it, which\n is why Miguan \nhas a peaceful tone.\n Look at how KIA baked a thin egg, if\n you don't like it, come and beat it.\n ",
    "word_count": 37,
    "locations": [],
    "score": 2.0,
    "matched_keywords": {
      "KIA": 2
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78004",
    "username": "Unknown Sender",
    "time": "23.08.2025 10:52:11 UTC+05:30",
    "text_snippet": "\n\nArmy drone \nsquad destroys a terrorist PDF group that is plaguing the public on the Trail of the Emerald Mountains.\n\n",
    "word_count": 20,
    "locations": [],
    "score": 1.8,
    "matched_keywords": {
      "drone": 1,
      "army": 1,
      "PDF": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77872",
    "username": "Unknown Sender",
    "time": "21.08.2025 11:48:29 UTC+05:30",
    "text_snippet": "\n\nI\n want to laugh at the fact that the promoters \nsometimes\nsee the rebound of posts that have\nbeen said in this way, and I \nsee that there are only\n two things that they can do when it comes to \npolitics, one \nis, as\nLi Kuanyu said, the lowest level of politics, which is to arm\n the people.\nThe other is to attack the army with the tactic\nthat if you attack the army with\npig-headed tactics, it is political, and\n in this way you make the people\nbleed, and they\nrun abroad with their heels and hips, which is the beginning of the politics of\nthe '88 generation.\nHe also doesn't seem to understand\nthe nature of direct transition and\ntransition in\nHeltington's democracy: \nwhen the problems\nof political conflict that arise are left unresolved, and when a domestic/foreign\nwar breaks\nout, democracy comes to a pause. \nTo name just two examples,\nZelenskyy, whose current president\nis\nout of office because of the war in Ukraine, is continuing to be president.\n This is a temporary pause in democracy, and \nthe same is true in Myanmar, where the problem of voter fraud in the 2020 elections\n Democracy has been at a standstill for a period of time because of the unresolved NLD\n, and\n now the political gurus\ndon't know\nwhich country they are fleeing to, and \nthe number of people\nwho died because of their actions is the fourth highest in the\nworld with 15,420 deaths\nfrom August 2024 to August 2025.\n \nI don't want to blame them\nfor running away because they don't want to take responsibility, but we need to stop the people\nwho are fueling the\ndeath toll of the people.\"\n ",
    "word_count": 285,
    "locations": [],
    "score": 1.7,
    "matched_keywords": {
      "army": 2,
      "fraud": 1,
      "NLD": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78064",
    "username": "Confusion",
    "time": "23.08.2025 20:27:59 UTC+05:30",
    "text_snippet": " Today, the Army fatally captured a terrorist PDF that was mining a public road on the side of Iron Mountain, resulting\nin the seizure of 1 violent body \nand 1 gun.\n ",
    "word_count": 31,
    "locations": [],
    "score": 1.6,
    "matched_keywords": {
      "gun": 1,
      "army": 1,
      "PDF": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77958",
    "username": "Confusion",
    "time": "22.08.2025 14:05:55 UTC+05:30",
    "text_snippet": "\n\n#VoiceOfPeople_Myanmar\n(VOP)\nVOP TikTok: \nhttps://www.tiktok.com/\n I want you to be weak and arrogant (PDF and 'P' triple arms) \n@voiceofpeoplemyanmar\nVOP Facebook: \nhttps://www.facebook.com/profile.php?id=61578099752916\nVOP YouTube Channel: \nhttp://www.youtube.com/@VoiceofPeopleMyanmar\n\n",
    "word_count": 26,
    "locations": [],
    "score": 1.5,
    "matched_keywords": {
      "arms": 1,
      "PDF": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77818",
    "username": "Confusion",
    "time": "20.08.2025 15:02:51 UTC+05:30",
    "text_snippet": "\n\nThanksgiving on behalf of the people of Pooh The\n \nfood convoy has arrived in Poo, consisting of more than 100 trucks carrying food for the local people in the town of Poo.\n-\nThe food convoy is closely secured by Army \nand Police Commando\nlines, clearing obstacles along the route for 84 days\n, and crossing obstacles along the way. \nThey successfully carried out the operation and the elimination of terrorists and arrived in Perth on \nAugust 20 (today\n).\n-\nPictures of the local people and department staff happily welcoming them.\n-\nOn behalf of the \npeople, special thanks to the members of the army and police\n.🙏🙏🙏\n-\nBattle \ndetails\n\n",
    "word_count": 112,
    "locations": [],
    "score": 1.4,
    "matched_keywords": {
      "convoy": 2,
      "army": 2
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77869",
    "username": "Confusion",
    "time": "21.08.2025 09:51:51 UTC+05:30",
    "text_snippet": "\n\nKhit Thit, which is creating fake news that 10 short-range rockets were fired at 13 of the 7-mile strike \nzone-\n-On August 20, no short-range rockets were fired in the 13th area, according to ground\n reports-which\n are baseless and misleading propaganda from Khit Thit\n:\nAnd then you're going to shoot with a rocket and shoot a missile, like you shoot a missile, how many people are dead, what is damaged... 😂😂😂\n \n#Fakenew Click to read FACTCHECK\nnews 👉\n\n",
    "word_count": 79,
    "locations": [
      "the 7-mile strike zone- -On August",
      "in the 13th area, according to",
      "ground reports-which are baseless and misleading"
    ],
    "score": 1.4,
    "matched_keywords": {
      "missile": 2
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78084",
    "username": "Confusion",
    "time": "24.08.2025 14:40:05 UTC+05:30",
    "text_snippet": "\n\n*Invitation to the Shanghai Cooperation Orgranization Summit\n*\n#တရ\nChina will host the Shanghai Cooperation Orgranization Summit in Tianjin from 31-8-2025 to 1-9-2025\n#အ\n \nThe summit will also be attended by Russian President Vladimir Putin, the Secretary-General of the United Nations and elders from more than 20 countries, and other negotiating countries, including India, have also been invited, and Myanmar is a partner country starting in 2023. \n#အ\nThe SCO is led by China to economically compete with the European Union and Western bloc countries; It is\n a strong and important economic bloc in the region\n#အ\nand for countries like Myanmar, which has been embargoed by Western bloc countries, the opportunity to cooperate is very beneficial.\n ",
    "word_count": 117,
    "locations": [
      "bloc in the region #အ and"
    ],
    "score": 1.4,
    "matched_keywords": {
      "china": 2,
      "United Nations": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77765",
    "username": "Unknown Sender",
    "time": "19.08.2025 19:36:15 UTC+05:30",
    "text_snippet": " The Myanmar Army's frigate Sin Phyu Shin participated in the 3rd ASEAN Multilateral Naval Exercise (AMNEX) 2025 in Penang, Malaysia... \nCongratulations, Army😘😘😘😘 Corps of Engineers. ",
    "word_count": 25,
    "locations": [],
    "score": 1.2,
    "matched_keywords": {
      "army": 2,
      "ASEAN": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77878",
    "username": "Confusion",
    "time": "21.08.2025 13:05:26 UTC+05:30",
    "text_snippet": "\n\nIndia \nand the United States desperately wanted the Burmese Mineral Crisis, and KIA's new \nplayground During World War II, the old Lido Road was being rebuilt by India, the BBC reported. Why is this abandoned road now alive in November 1945?\n-\nThe road that was built at the suggestion of American General Steelwell is called the Steelwell Road. India is accelerating the Connected Highway project.\n-\nI think the fact that India wants strategic opportunities as much as the U.S. wants rare earths is one of the factors that have awakened this highway. \n-\nRare earth minerals are a popular mineral of the world's industrialized nations and one of the world's most respected minerals. Among the few countries that produce rare earths, the rare earth ore from the Panwa region in northern Myanmar is the Heavy Rear Earth, which is quite famous and valuable in the world. \n-\nNot only modern intercontinental ballistic missiles, but also high-tech electronics, rare earth metals are indispensable in the world today, and Myanmar neighbor China accounts for a large percentage of the world's rare earth metals trading market. Rare earth minerals are 17 mineral elements that are difficult to produce and technically complex, so only a few countries have the potential to produce them.\n»Continue Reading»\n\n",
    "word_count": 213,
    "locations": [
      "from the Panwa region in northern"
    ],
    "score": 1.2,
    "matched_keywords": {
      "china": 1,
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77890",
    "username": "Confusion",
    "time": "21.08.2025 16:25:01 UTC+05:30",
    "text_snippet": "\n\nViolent Spring Lynch-led MRO/CDF-Mapi Recruits Kidnapped Youths for Military Service Conflicts with Locals\n Video \nFootage Terrorists Kill All in Battles with the Army Kidnap Ignorant Underage Children\nRecruit Recruits Don't Put\nNew Jeans on It\n\n",
    "word_count": 35,
    "locations": [],
    "score": 1.2,
    "matched_keywords": {
      "military": 1,
      "army": 1,
      "CDF": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78073",
    "username": "Confusion",
    "time": "24.08.2025 10:36:05 UTC+05:30",
    "text_snippet": "\n\n125-year-old World Heritage Site Monument Destroyed by Terrorist Plague TNLA Cult\n Mines Headquarters \nof Barbarians Are Towns Just to Be Beautiful?\n\n",
    "word_count": 21,
    "locations": [],
    "score": 1.2,
    "matched_keywords": {
      "destroyed": 1,
      "TNLA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78119",
    "username": "Confusion",
    "time": "24.08.2025 21:13:46 UTC+05:30",
    "text_snippet": "\n\nToday, I wrote a female paddle: \nWe see that MDY-PDFs are on the run and are depressed because of the high number of injuries, and that the families of the fleeing PDFs in this depression are exploding because they are pressuring and threatening to kill the families of the fleeing PDFs... \nI mean, like these guys say, PDFs are broken... \nInevitably, the Army is taking back one city after another in great force, and it's quite technologically advanced... \nIf you continue in the jungle without consciousness at this time, you are doomed to death... \nSimply put, the escaped PDFs were spared... \nEven today, the Army has taken back the Wax Mountain... I'm going to keep it all going forward... \nSo if you run away, your family will still be threatened, and\nif the light shines, you will have to stay with your family and have a job... \nYou can choose the path you like... You're going to have to keep in touch with the little ones who are enlightened... Let's ask...//Wow\n.\n\n",
    "word_count": 172,
    "locations": [
      "taking back one city after another"
    ],
    "score": 1.2,
    "matched_keywords": {
      "army": 2,
      "MDY": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77838",
    "username": "Confusion",
    "time": "20.08.2025 20:33:01 UTC+05:30",
    "text_snippet": " Hundreds of thousands of people have been swept away by the line of the King's Army\nagainst the terror KIA groups holed up in the vegetarian neighborhood of Venmore.\n ",
    "word_count": 29,
    "locations": [],
    "score": 1.1,
    "matched_keywords": {
      "army": 1,
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77839",
    "username": "Unknown Sender",
    "time": "20.08.2025 20:47:33 UTC+05:30",
    "text_snippet": " The Army again occupies a terror TNLA camp based in the Courtyard near the\nJewel of the Outer Horizon.\n ",
    "word_count": 19,
    "locations": [
      "a terror TNLA camp based in",
      "terror TNLA camp based in the"
    ],
    "score": 1.1,
    "matched_keywords": {
      "army": 1,
      "TNLA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77897",
    "username": "Unknown Sender",
    "time": "21.08.2025 19:05:53 UTC+05:30",
    "text_snippet": "\n\nViolent TNLA group in Nong Binh Village, Black Stone Township was wiped out by the Army 3\n machetes and 2 weapons confiscated.\n\n",
    "word_count": 22,
    "locations": [],
    "score": 1.1,
    "matched_keywords": {
      "army": 1,
      "TNLA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77959",
    "username": "Confusion",
    "time": "22.08.2025 15:06:06 UTC+05:30",
    "text_snippet": "\n\nConfrontation with \nWarazuk People's Army Commando in Shahduzuk on August 21, \n2015 Defeated KIA terrorists flee in a riot without picking\n up bodies August 22, 2025.Photo\n... KDN\n.\n\n",
    "word_count": 29,
    "locations": [],
    "score": 1.1,
    "matched_keywords": {
      "army": 1,
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78009",
    "username": "Unknown Sender",
    "time": "23.08.2025 14:17:12 UTC+05:30",
    "text_snippet": "\n\n#ခ\nBullet Spikes Guan\nMo seems to be very scared. Unite and\nshow his allies that he is mobilizing his troops and allies to make a mote\n.\n Don't be afraid of anything, just think that your luck has\ncome back to you. The government and the army have forgiven you many times, and they have given you leniency, but\n this time in any way. \nThere is no reason to forgive them in any way, for \n in the eyes\nof their own soldiers who are eager to plant the flag in Lysa, they are exploding with all their might, imagining the rape and massacre of the families of the police who had retreated from Muncie.BURMESE AND BUDDHISTS HAVE NOT FORGOTTEN THAT A KACHIN FEMALE SINGER WENT UP TO THE PRAYER HILL IN HER SHOES AND INSULTED THE ENTIRE BURMA NATION.IF\n YOU FORGIVE SUCH A STUPID KIO KIA, THERE WOULD BE NO MORE\nWRONG MISTAKE. \nIt's like getting out of prison and releasing them over and over again.When you get out of prison, you're just going to do the usual crime again, and you can't be merciful\nbecause of the dog-tailed bullets.When\n it comes to sovereignty, I just want to\nurge you to turn the dice out of the American knot and turn it all over.\n ",
    "word_count": 215,
    "locations": [],
    "score": 1.1,
    "matched_keywords": {
      "army": 1,
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77809",
    "username": "Unknown Sender",
    "time": "20.08.2025 13:32:57 UTC+05:30",
    "text_snippet": "\n\nThe Myanmar Army's frigate Sin Phyu Shin participated in the 3rd ASEAN Multilateral Naval Exercise (AMNEX) 2025 in Penang, Malaysia... \nConfusion\n\n",
    "word_count": 21,
    "locations": [],
    "score": 1.1,
    "matched_keywords": {
      "army": 1,
      "ASEAN": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77937",
    "username": "Unknown Sender",
    "time": "22.08.2025 10:04:44 UTC+05:30",
    "text_snippet": "\n\nTerror Paddas\n carrying weapons were raided by the Patrol Corps near the god of Maddakkal, Long Term Township, 1 \nbody of Terror Padad\n, 5\nguns and\nammunition confiscated.Whistleblowers\n are good.Whistleblowing.If\n you want to get to your area quickly, please send a confidential report of the terrorists.Anonymous\n\n",
    "word_count": 47,
    "locations": [
      "get to your area quickly, please"
    ],
    "score": 1.0,
    "matched_keywords": {
      "guns": 1,
      "ammunition": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77742",
    "username": "Confusion",
    "time": "19.08.2025 09:55:52 UTC+05:30",
    "text_snippet": " NUG says that he doesn't have to go down to his level and the bottom of the canal, but he doesn't know about the paddles, he doesn't even have to go down to the bottom, and if he gets a donation,\n he can't even\n get down to the bottom with a beggar\n.\n ",
    "word_count": 53,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "NUG": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77743",
    "username": "Confusion",
    "time": "19.08.2025 10:55:29 UTC+05:30",
    "text_snippet": " ✳️ This \nmorning,\nAugust 19, 2025, local people in the southern Shan Province of Shan were conducting a peaceful procession with the aim of expediting the evacuation of the MNDAA and its terrorist affiliates in the southern Shan Province and the evacuation of the indigenous Sham people.\n\n",
    "word_count": 47,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "MNDAA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77753",
    "username": "Confusion",
    "time": "19.08.2025 12:56:32 UTC+05:30",
    "text_snippet": "\n\nThis morning,\nAugust 19, 2025, local people in Lyin called for the expeditious departure of the MNDAA and terrorist affiliates in Thibao, Thipao, Thienne... \nConfusion\n\n",
    "word_count": 25,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "MNDAA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77759",
    "username": "Unknown Sender",
    "time": "19.08.2025 13:23:13 UTC+05:30",
    "text_snippet": "\n(\nPeople \nwith bad hearts shouldn't watch it.)\n3 men and 2 women in Tamu Township brutally beheaded\n3 men and 2 women in Tamu Township in Tamil Nakhon Township... \nThe video file is now a PDF file taken from\na phone that was killed during the battle\n.\n\n",
    "word_count": 49,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "PDF": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77774",
    "username": "Unknown Sender",
    "time": "19.08.2025 19:38:32 UTC+05:30",
    "text_snippet": "\n\nI got all the cups at my dad's wedding, I\ngot the Esport Cup,\nI got the Women's Football Cup, and\nthe NUG guy got a cup each.😂😂\n\n",
    "word_count": 28,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "NUG": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77870",
    "username": "Confusion",
    "time": "21.08.2025 11:42:18 UTC+05:30",
    "text_snippet": " I've got to tell KIA and AA that\nif you get the tickets, I'll\n lend you a little bit, but \nI want to fly.\n😂😂😂😂\n ",
    "word_count": 25,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77877",
    "username": "Confusion",
    "time": "21.08.2025 12:47:55 UTC+05:30",
    "text_snippet": " Bodies of Kia officer killed\nin Venmore\nVox ",
    "word_count": 8,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77882",
    "username": "Unknown Sender",
    "time": "21.08.2025 15:22:56 UTC+05:30",
    "text_snippet": "\n\nBurning of terrorist KIA group\nnear Venmore University\n\n",
    "word_count": 8,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77883",
    "username": "Confusion",
    "time": "21.08.2025 15:59:18 UTC+05:30",
    "text_snippet": "\n\nIt's just\n as \ngood\n😁😁😁\nas KIA.\n\n",
    "word_count": 7,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77936",
    "username": "Confusion",
    "time": "22.08.2025 09:58:39 UTC+05:30",
    "text_snippet": "\n\nIn Venmore, the brilliance is out, look\n at the end,\n the KIA guy is torn.Wow\n.\n\n",
    "word_count": 16,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77968",
    "username": "Confusion",
    "time": "22.08.2025 18:59:02 UTC+05:30",
    "text_snippet": " Kia is a general-level\nunwise and shameless What he is \nsaying is Put on \n a twab I admire the \nwords of the young educated and brave Pei Ming Zesheng replied I admired the words The\nwhole country knows which\none is a heroine Vox\nhttps://t.me/voxnews7\n\n",
    "word_count": 45,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77990",
    "username": "Confusion",
    "time": "23.08.2025 09:09:15 UTC+05:30",
    "text_snippet": " In the township of Kamburu it is advertised that there are 4 tax stations of the Padds, and this is not even the place where the gold ore is produced.\n__\nAccording to the statistics they have shown, it is stated that even if you own a cart, you will be taxed at 20 thousand rupees, and if you collect 100,000 per cattle, 300 per gallon of petrol and 50 per bamboo, it is not strange that the armed revolution is not suppressed. They're coming..... From their point of view, what do they want the election to be? \n_\nEven in Cumberland, not to mention that in places like the Skyline and the Strike, not to mention that the Pads like the NUG and the Zombies want to sit on the fins, it's really garbage that needs to be cleaned up. \n ",
    "word_count": 141,
    "locations": [
      "In the township of Kamburu",
      "are 4 tax stations of the"
    ],
    "score": 1.0,
    "matched_keywords": {
      "NUG": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78005",
    "username": "Confusion",
    "time": "23.08.2025 11:14:59 UTC+05:30",
    "text_snippet": "\n\nI watched the cartoon and\nthe squirrels were agitated,\n and they were dying on the front lines, and they didn't have any children.For\n now, take care of your slaves in the TNLA first, Mustafa\nand Osama later,😁😁\nright?\n\n",
    "word_count": 38,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "TNLA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78008",
    "username": "Unknown Sender",
    "time": "23.08.2025 14:12:00 UTC+05:30",
    "text_snippet": " I wouldn't\n😂😂😂\nhave been happy if the head of the KIA, Mustafa Osama Miguan, knew about this. ",
    "word_count": 18,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78014",
    "username": "Confusion",
    "time": "23.08.2025 15:17:51 UTC+05:30",
    "text_snippet": " Burning KIA in Venmore.I'm\n satisfied with what to say.Hey\n Miss Guangre\n, come and see\nhow your little ones are being burned. ",
    "word_count": 22,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "KIA": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78054",
    "username": "Unknown Sender",
    "time": "23.08.2025 19:43:10 UTC+05:30",
    "text_snippet": "\n\nNUG😂😂😂\nPunches a Nutcracker and a Death Eater\n\n",
    "word_count": 8,
    "locations": [],
    "score": 1.0,
    "matched_keywords": {
      "NUG": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78006",
    "username": "Confusion",
    "time": "23.08.2025 13:45:07 UTC+05:30",
    "text_snippet": "\n\nThe Army Drone Squad is so sharp that it doesn't even have to\n😁😁\nbe dragged away by a gang of violent hounds who are outpacing the\npublic on the Mt. Moore Trail\n\n",
    "word_count": 33,
    "locations": [],
    "score": 0.8,
    "matched_keywords": {
      "drone": 1,
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78053",
    "username": "Confusion",
    "time": "23.08.2025 19:40:19 UTC+05:30",
    "text_snippet": "\n\nWhen the city of Demosso was captured, \nthe Army Drone Squadron did \nthe same\nthing.\n\n",
    "word_count": 15,
    "locations": [
      "When the city of Demosso"
    ],
    "score": 0.8,
    "matched_keywords": {
      "drone": 1,
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77874",
    "username": "Confusion",
    "time": "21.08.2025 12:14:05 UTC+05:30",
    "text_snippet": "\n\nThe convoy that \narrived at the gate yesterday made an 84-day journey\n:\n along the way, there were 39 terrorist encounters with army and police commando lines, 431 mine clearances, 59 corpses, 37 weapons, 709 mines of all kinds, 1 officer, 7 soldiers+policemen gave their lives\n for the country\nWhether it's a good\n🙏🙏🙏\nmemorial to the heroes who gave their lives, blood, and sweat for the natives. ",
    "word_count": 68,
    "locations": [],
    "score": 0.7,
    "matched_keywords": {
      "convoy": 1,
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78108",
    "username": "Confusion",
    "time": "24.08.2025 19:16:53 UTC+05:30",
    "text_snippet": "\n\nBody/Weapon Acquired (Strike)\nOn the morning of August \n24\n, a drunken and intoxicated terrorist, armed with a motorcycle, shot and captured 1 terrorist, 1 \nbody, 1 hand\n, 1 hand,\n 1\n hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 \nhand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand, 1 hand-\nBattle Briefing\n\n",
    "word_count": 191,
    "locations": [],
    "score": 0.5,
    "matched_keywords": {
      "weapon": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77787",
    "username": "Unknown Sender",
    "time": "19.08.2025 20:36:06 UTC+05:30",
    "text_snippet": " Demosso\n is occupied \nby soldiers who beat the corpses of the terrorists to the car, and the gods of war in the land of the gods of war.\n ",
    "word_count": 28,
    "locations": [],
    "score": 0.4,
    "matched_keywords": {
      "occupied": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77798",
    "username": "Confusion",
    "time": "20.08.2025 09:33:54 UTC+05:30",
    "text_snippet": "\n\nThe Army's mission is the defense of the State, and when elections are held, the Army Congressional Representatives will participate in the National Assembly, perform the national political role assigned by the Constitution, and defend the Constitution when the winning party performs its national duties...... \nThe Army will not engage in politics but will only\nserve the national defense service.\n\n",
    "word_count": 60,
    "locations": [],
    "score": 0.3,
    "matched_keywords": {
      "army": 3
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77925",
    "username": "Confusion",
    "time": "22.08.2025 08:43:11 UTC+05:30",
    "text_snippet": " Violent PDFs have blocked the whole area... \nThis is where most of the Red Devils are based, and\n the townspeople are really in trouble.\n They are the people who block them,\n and they think they can make a big profit. They don't even have to go over the army convoys.\n \nThe feast of proving with blood and sweat the true mercy of his army.\n \nViolence in the area... \n(red-green) Became the sour bread of all the local people.Don't\n lie that you blocked the war lines.With\n a small letter that I had saved, your wickedness was exposed.The\n well-known Thorbon saw his sinner, but... \nA low-class violent guy like Bonito... \n The Army has won the hearts of the people of \nthe country on this occasion.... \"Oh my God, I don't know.\n \nClick to 👉🏿 read more MAT stories\n\n",
    "word_count": 136,
    "locations": [
      "blocked the whole area... This is",
      "Red Devils are based, and the",
      "Violence in the area... (red-green) Became"
    ],
    "score": 0.3,
    "matched_keywords": {
      "army": 3
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77991",
    "username": "Confusion",
    "time": "23.08.2025 09:10:26 UTC+05:30",
    "text_snippet": " Chairman of the Mandalay Solidarity and Development Party met with youth party members from the townships of Mandalay\n Province=================================\nAugust 20, 2025, Chairman of the Mandalay\nSolidarity and Development Party, along with Vice Chairman and Central Executives, Dr. Meng Thien, Chairman of the Mandalay Regional Party, and Chairman of the Mandalay Regional Party, Tong Hao Mo, on the afternoon of August 20, 2025.The ceremony was held at the Provincial Party Hall, attended the meeting with the youth of the Party, the youth around the Party and the youth who were interested in the activities of the Party.The\n ceremony was opened with the national flag hoisted, and the Party Chairman and Vice Chairman explained to the attending youth the formation of the Party, the formation of the Party, the characteristics and activities of the Party, and the aspirations. Afterwards, the youth in attendance asked about the role of youth and women, empowerment, access to employment opportunities, the importance of an election in a country, issues related to elections, and future educational roles, which were answered by the party president, vice president and central executives.\nIt was reported that the meeting was attended by the Chairman of the Party for the Strength and Development of the Union, Dr. Meng Thien, the Chairman of the Party of the People's Republic of China, the Chairman of the Party of Manta Province, the Chairman of the Party of Manta Province, the Chairman of the Provincial Committee, the district chairmen, the youth of the Party members of the 10 townships, the youth of the Party and the youth who were interested in the activities of the Party. ",
    "word_count": 271,
    "locations": [
      "members from the townships of Mandalay",
      "of the 10 townships, the youth"
    ],
    "score": 0.2,
    "matched_keywords": {
      "china": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78083",
    "username": "Unknown Sender",
    "time": "24.08.2025 14:23:06 UTC+05:30",
    "text_snippet": " The bridge was broken by the rebels of the Caucasus.Cochizor\n (first-hand report)\n24-08-2025 ",
    "word_count": 13,
    "locations": [],
    "score": 0.2,
    "matched_keywords": {
      "rebels": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78111",
    "username": "Confusion",
    "time": "24.08.2025 19:52:34 UTC+05:30",
    "text_snippet": "\n\nIf I wanted to be alone, I would drive out the pipes that were creeping up in the monasteries of the mainland... \nAnd when they grow up, they're 90% rebellious. Adults know that, too. \nthat we Burmese love our people as natives, not on the basis of race... These rebels are instilling hatred on the basis of race. \nAfter a while, it hurts. \nConfusion\n\n",
    "word_count": 64,
    "locations": [],
    "score": 0.2,
    "matched_keywords": {
      "rebels": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77763",
    "username": "Confusion",
    "time": "19.08.2025 19:31:22 UTC+05:30",
    "text_snippet": "\n\nThe girls under the military commission are only teford, and 😁😁😁\nthey tremble because they are so scared.\n\n",
    "word_count": 18,
    "locations": [],
    "score": 0.1,
    "matched_keywords": {
      "military": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77775",
    "username": "Confusion",
    "time": "19.08.2025 20:14:37 UTC+05:30",
    "text_snippet": "\n\n19-8-2025 Today, the Army completely recaptures \nthe city of Dimosso.\n\n",
    "word_count": 10,
    "locations": [
      "completely recaptures the city of Dimosso."
    ],
    "score": 0.1,
    "matched_keywords": {
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77797",
    "username": "Confusion",
    "time": "20.08.2025 08:18:52 UTC+05:30",
    "text_snippet": "\n\nDo you have no self-confidence..? \nDo you want to be disciplined and have a bright personality..? \nDo you want to show masculinity..? \nOr do you want to color yourself with the title of hero..? \nDo you want to show off your bravery in the battles of the city..?\n👇👇👇\n The opportunity to be a hero \"wants you from the army\"\n \nis on your doorstep.\n ",
    "word_count": 64,
    "locations": [
      "battles of the city..? 👇👇👇 The"
    ],
    "score": 0.1,
    "matched_keywords": {
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77801",
    "username": "Confusion",
    "time": "20.08.2025 11:10:10 UTC+05:30",
    "text_snippet": "\n\n19-8-2025 After the total recapture of Dimosso by the army yesterday, the cries of the gods of\n war will be \ndeafening.\n\n",
    "word_count": 21,
    "locations": [],
    "score": 0.1,
    "matched_keywords": {
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77805",
    "username": "Confusion",
    "time": "20.08.2025 13:08:29 UTC+05:30",
    "text_snippet": "\n\nAwarding\n of the first prize winner of the \nRainy Season Football Tournament by\n the Deputy Commander of the Warazuk People's Army, Lt. Col. Rabal Anzoshin \nhttps://t.me/warazuppeople567\n\n",
    "word_count": 26,
    "locations": [],
    "score": 0.1,
    "matched_keywords": {
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message77970",
    "username": "Confusion",
    "time": "22.08.2025 19:13:18 UTC+05:30",
    "text_snippet": "\n\nThe terrorists in Pearl King's Village have been defeated and taken over by the army.\n\n",
    "word_count": 15,
    "locations": [],
    "score": 0.1,
    "matched_keywords": {
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78012",
    "username": "Confusion",
    "time": "23.08.2025 14:29:27 UTC+05:30",
    "text_snippet": " What are you afraid of, the\nmilitary commission is powerless, and😁😁\nyou are so scared\n😁😁\n. ",
    "word_count": 17,
    "locations": [],
    "score": 0.1,
    "matched_keywords": {
      "military": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78035",
    "username": "Confusion",
    "time": "23.08.2025 18:54:55 UTC+05:30",
    "text_snippet": " Congratulations to the victorious veterans of the Northwest Military Headquarters\n.\n😊😊😊\n ",
    "word_count": 12,
    "locations": [],
    "score": 0.1,
    "matched_keywords": {
      "military": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78096",
    "username": "Confusion",
    "time": "24.08.2025 18:24:21 UTC+05:30",
    "text_snippet": " Today, the Army reoccupies\n😊😊😊\nthe Matra Wax Factory. ",
    "word_count": 9,
    "locations": [],
    "score": 0.1,
    "matched_keywords": {
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78105",
    "username": "Confusion",
    "time": "24.08.2025 19:03:57 UTC+05:30",
    "text_snippet": "\n\n23-8-2025 Yesterday\n, a terror Paddock patrolled near Dog Ridge in Strike Township was fatally shot at an Army line.\n\n",
    "word_count": 20,
    "locations": [],
    "score": 0.1,
    "matched_keywords": {
      "army": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78056",
    "username": "Unknown Sender",
    "time": "23.08.2025 20:05:33 UTC+05:30",
    "text_snippet": "\n\nUSDP Chairman Kyung Kin Yee and his team arrived in Nagpur to provide\nsupplies to members of the security forces and party members.\n\n",
    "word_count": 23,
    "locations": [],
    "score": 0.01,
    "matched_keywords": {
      "forces": 1
    }
  },
  {
    "file": "messages_translated1.html",
    "message_id": "message78025",
    "username": "Confusion",
    "time": "23.08.2025 15:56:27 UTC+05:30",
    "text_snippet": " 🏆🏆🏆 \nUnable to withstand the attack of the Neptune Heroes in the village of Neptune, the village was burned to the ground and fled.\n-\nCongratulations to the Neptune\n Heroes-Battle\n \nNews\n\n",
    "word_count": 31,
    "locations": [
      "Heroes in the village of Neptune,",
      "of Neptune, the village was burned"
    ],
    "score": 0.0,
    "matched_keywords": {}
  }
]